research/visualization_methods/outputs/Gamma Mixture__gamma_mixture_model/gamma_mixture_model.dot
digraph G {
  "Categorical" [label="Categorical"];
  "Dirichlet" [label="Dirichlet"];
  "Gamma" [label="Gamma"];
  "GammaMixture" [label="GammaMixture"];
  "GammaShapeRate" [label="GammaShapeRate"];
  "MeanField" [label="MeanField"];
  "MersenneTwister" [label="MersenneTwister"];
  "MixtureModel" [label="MixtureModel"];
  "_as, _bs" [label="_as, _bs"];
  "_dists" [label="_dists"];
  "_mixing" [label="_mixing"];
  "_mixture" [label="_mixture"];
  "a" [label="a"];
  "as" [label="as"];
  "b" [label="b"];
  "begin" [label="begin"];
  "bs" [label="bs"];
  "dataset" [label="dataset"];
  "default_factorisation" [label="default_factorisation"];
  "end" [label="end"];
  "g" [label="g"];
  "gamma_mixture_model" [label="gamma_mixture_model"];
  "gmodel" [label="gmodel"];
  "gpriors" [label="gpriors"];
  "histogram" [label="histogram"];
  "i" [label="i"];
  "layout" [label="layout"];
  "length" [label="length"];
  "map" [label="map"];
  "mean" [label="mean"];
  "mixing" [label="mixing"];
  "mixingsum" [label="mixingsum"];
  "mixture" [label="mixture"];
  "mixtures" [label="mixtures"];
  "n_samples" [label="n_samples"];
  "nmixtures" [label="nmixtures"];
  "p1" [label="p1"];
  "p2" [label="p2"];
  "p3" [label="p3"];
  "parameters" [label="parameters"];
  "plot" [label="plot"];
  "plot(plot(p1, p2, layout" [label="plot(plot(p1, p2, layout"];
  "q" [label="q"];
  "q(as)" [label="q(as)"];
  "q(bs)" [label="q(bs)"];
  "q(z)" [label="q(z)"];
  "q(z, as, bs, s)" [label="q(z, as, bs, s)"];
  "rand" [label="rand"];
  "rate" [label="rate"];
  "rng" [label="rng"];
  "s" [label="s"];
  "shape" [label="shape"];
  "size" [label="size"];
  "switch" [label="switch"];
  "vague" [label="vague"];
  "xlim" [label="xlim"];
  "y" [label="y"];
  "ylim" [label="ylim"];
  "z" [label="z"];
  "Categorical" -> "q(z)";
  "Categorical" -> "z";
  "Dirichlet" -> "s";
  "Gamma" -> "as";
  "Gamma" -> "bs";
  "GammaMixture" -> "y";
  "GammaShapeRate" -> "q(bs)";
  "MeanField" -> "default_factorisation";
  "MersenneTwister" -> "rng";
  "MixtureModel" -> "_mixture";
  "MixtureModel" -> "mixture";
  "_dists" -> "_mixture";
  "_mixing" -> "_mixture";
  "_mixture" -> "p2";
  "a" -> "plot(plot(p1, p2, layout";
  "a" -> "y";
  "as" -> "q(as)";
  "as" -> "y";
  "b" -> "plot(plot(p1, p2, layout";
  "b" -> "y";
  "begin" -> "q(as)";
  "begin" -> "q(bs)";
  "bs" -> "q(bs)";
  "bs" -> "y";
  "dataset" -> "p1";
  "dataset" -> "p2";
  "end" -> "_as, _bs";
  "end" -> "q(as)";
  "end" -> "q(bs)";
  "g" -> "_dists";
  "gamma_mixture_model" -> "gmodel";
  "gpriors" -> "gmodel";
  "histogram" -> "p1";
  "histogram" -> "p2";
  "i" -> "as";
  "i" -> "bs";
  "i" -> "y";
  "layout" -> "plot(plot(p1, p2, layout";
  "length" -> "nmixtures";
  "map" -> "_dists";
  "mean" -> "_as, _bs";
  "mean" -> "_mixing";
  "mixing" -> "mixing";
  "mixing" -> "mixture";
  "mixingsum" -> "mixing";
  "mixture" -> "dataset";
  "mixture" -> "p1";
  "mixtures" -> "mixture";
  "mixtures" -> "nmixtures";
  "n_samples" -> "dataset";
  "nmixtures" -> "mixing";
  "parameters" -> "gmodel";
  "plot" -> "p1";
  "plot" -> "p2";
  "plot" -> "p3";
  "q" -> "q(as)";
  "q" -> "q(bs)";
  "q" -> "q(z, as, bs, s)";
  "rand" -> "dataset";
  "rand" -> "mixing";
  "rate" -> "as";
  "rate" -> "bs";
  "rng" -> "dataset";
  "rng" -> "mixing";
  "s" -> "z";
  "shape" -> "as";
  "shape" -> "bs";
  "size" -> "plot(plot(p1, p2, layout";
  "switch" -> "y";
  "vague" -> "q(z)";
  "xlim" -> "p1";
  "xlim" -> "p2";
  "ylim" -> "p1";
  "ylim" -> "p2";
  "z" -> "y";
}
